[
  {
    "axiomId": "something_exists",
    "question": "Do you accept that something exists (at minimum, your own existence as a thinking being)?",
    "explanation": "This is the most fundamental metaphysical principle - that existence is real and undeniable, evident in your own consciousness.",
    "category": "metaphysics"
  },
  {
    "axiomId": "non_contradiction",
    "question": "Do you accept the principle of non-contradiction - that something cannot both be and not be in the same respect?",
    "explanation": "This is the foundational principle of logic - that contradictory statements cannot both be true, and consistency is required for rational thought.",
    "category": "logic"
  },
  {
    "axiomId": "senses_reliable",
    "question": "Do you believe our senses provide reliable knowledge of the external world?",
    "explanation": "This asks whether sense experience, though sometimes mistaken, generally gives us genuine information about material reality.",
    "category": "epistemology"
  },
  {
    "axiomId": "causation_principle",
    "question": "Do you accept that every effect has a cause?",
    "explanation": "This is the principle of sufficient reason - that nothing comes into being without an adequate explanation for its existence.",
    "category": "metaphysics"
  },
  {
    "axiomId": "change_occurs",
    "question": "Do you observe that change and motion occur in reality?",
    "explanation": "This asks whether you accept the evident fact that things move, change, and transition from potential to actual states.",
    "category": "metaphysics"
  },
  {
    "axiomId": "contingent_necessary_distinction",
    "question": "Can you distinguish between things that exist contingently versus necessarily?",
    "explanation": "This asks whether you recognize that some things exist but could have not existed, while others (if they exist) must exist by their very nature.",
    "category": "metaphysics"
  },
  {
    "axiomId": "degrees_of_perfection",
    "question": "Do you observe degrees of perfection, goodness, or excellence in reality?",
    "explanation": "This asks whether you think some things are genuinely more perfect, good, true, or noble than others - that there are real hierarchies of value.",
    "category": "metaphysics"
  },
  {
    "axiomId": "teleological_order",
    "question": "Do you observe that things appear ordered toward specific ends or purposes?",
    "explanation": "This asks whether natural things seem to act for definite goals or ends, even when they lack consciousness to direct themselves.",
    "category": "metaphysics"
  },
  {
    "axiomId": "reason_discovers_truth",
    "question": "Do you believe human reason can discover genuine truth about reality?",
    "explanation": "This asks whether careful rational thought can attain real knowledge about the world, including knowledge of metaphysical principles.",
    "category": "epistemology"
  }
]